# -*-*-*-*- coding: utf-8 -*-*-*-*-
# @Time    : 2019/8/15 上午4:41        
# @Author  : LpL                    
# @Email   : peilun2050@gmail.com    
#-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*
LIFE_MAP = {"2.1":"短命非业谓大凶，平生灾难事重重，凶祸频临限逆境，终世困苦事不成","2.2":"身寒骨冷苦伶仃，此命推来行乞人，劳劳碌碌无度日，中年打拱过平生","2.3":"此命推来骨轻轻，求谋做事事难成，妻儿兄弟应难许，别处他乡作散人","2.4":"此命推来福禄无，门庭困苦总难荣，六亲骨肉皆无靠，流到他乡作老人","2.5":"此命推来祖业微，门庭营度似希奇，六亲骨肉如水炭，一世勤劳自把持","2.6":"平生一路苦中求，独自营谋事不休，离祖出门宜早计，晚来衣禄自无忧","2.7":"一生做事少商量，难靠祖宗作主张，独马单枪空作去，早年晚岁总无长","2.8":"一生作事似飘蓬，祖宗产业在梦中，若不过房并改姓，也当移徒二三通","2.9":"初年运限未曾亨，纵有功名在后成，须过四旬方可上，移居改姓使为良","3":"劳劳碌碌苦中求，东走西奔何日休，若能终身勤与俭，老来稍可免忧愁","3.1":"忙忙碌碌苦中求，何日云开见日头，难得祖基家可立，中年衣食渐无忧","3.2":"初年运错事难谋，渐有财源如水流，到的中年衣食旺，那时名利一齐来","3.3":"早年做事事难成，百计徒劳枉费心，半世自如流水去，后来运到始得金","3.4":"此命福气果如何，僧道门中衣禄多，离祖出家方得妙，终朝拜佛念弥陀","3.5":"生平福量不周全，祖业根基觉少传，营事生涯宜守旧，时来衣食胜从前","3.6":"不须劳碌过平生，独自成家福不轻，早有福星常照命，任君行去百般成","3.7":"此命般般事不成，弟兄少力自孤成，虽然祖业须微有，来的明时去的暗","3.8":"一生骨肉最清高，早入学门姓名标，待看年将三十六，蓝衣脱去换红袍","3.9":"此命少年运不通，劳劳做事尽皆空，苦心竭力成家计，到得那时在梦中","4":"平生衣禄是绵长，件件心中自主张，前面风霜都受过，从来必定享安泰","4.1":"此命推来事不同，为人能干异凡庸，中年还有逍遥福，不比前年云未通","4.2":"得宽怀处且宽怀，何用双眉总不开，若使中年命运济，那时名利一齐来","4.3":"为人心性最聪明，做事轩昂近贵人，衣禄一生天数定，不须劳碌是丰亨","4.4":"来事由天莫苦求，须知福禄胜前途，当年财帛难如意，晚景欣然便不忧","4.5":"福中取贵格求真，明敏才华志自伸，福禄寿全家道吉，桂兰毓秀晚荣臻","4.6":"东西南北尽皆通，出姓移名更觉隆，衣禄无亏天数定，中年晚景一般同","4.7":"此命推来旺末年，妻荣子贵自怡然，平生原有滔滔福，可有财源如水流","4.8":"幼年运道未曾享，苦是蹉跎再不兴，兄弟六亲皆无靠，一身事业晚年成","4.9":"此命推来福不轻，自立自成显门庭，从来富贵人亲近，使婢差奴过一生","5":"为利为名终日劳，中年福禄也多遭，老来是有财星照，不比前番目下高","5.1":"一世荣华事事通，不须劳碌自亨通，兄弟叔侄皆如意，家业成时福禄宏","5.2":"一世亨通事事能，不须劳思自然能，宗施欣然心皆好，家业丰亨自称心","5.3":"此格推来气象真，兴家发达在其中，一生福禄安排定，却是人间一富翁","5.4":"此命推来厚且清，诗书满腹看功成，丰衣足食自然稳，正是人间有福人","5.5":"走马扬鞭争名利，少年做事废筹论，一朝福禄源源至，富贵荣华显六亲","5.6":"此格推来礼仪通，一生福禄用无穷，甜酸苦辣皆尝过，财源滚滚稳且丰","5.7":"福禄盈盈万事全，一生荣耀显双亲，名扬威震人钦敬，处世逍遥似遇春","5.8":"平生福禄自然来，名利兼全福禄偕，雁塔提名为贵客，紫袍金带走金鞋","5.9":"细推此格妙且清，必定才高礼仪通，甲第之中应有分，扬鞭走马显威荣","6":"一朝金榜快提名，显祖荣宗立大功，衣食定然原欲足，田园财帛更丰盈","6.1":"不做朝中金榜客，定为世上一财翁，聪明天赋经书熟，名显高克自是荣","6.2":"此名生来福不穷，读书必定显亲荣，紫衣金带为卿相，富贵荣华皆可同","6.3":"命主为官福禄长，得来富贵定非常，名题金塔传金榜，定中高科天下扬","6.4":"此格权威不可当，紫袍金带坐高堂，荣华富贵谁能及，积玉堆金满储仓","6.5":"细推此命福不轻，安国安邦极品人，文绣雕梁政富贵，威声照耀四方闻","6.6":"此格人间一福人，堆金积玉满堂春，从来富贵由天定，正笏垂绅谒圣君","6.7":"此名生来福自宏，田园家业最高隆，平生衣禄丰盈足，一世荣华万事通","6.8":"富贵由天莫苦求，万金家计不须谋，十年不比前番事，祖业根基水上舟","6.9":"君是人间衣禄星，一生福贵众人钦，纵然福禄由天定，安享荣华过一生","7":"此命推来福不轻，不须愁虑苦劳心，一生天定衣与禄，富贵荣华过一生","7.1":"此名生来大不同，公侯卿相在其中，一生自有逍遥福，富贵荣华极品隆","7.2":"此格世界罕有生，十代积善产此人，天上紫微来照命，统治万民乐太平"}
YEAR_MAP = {'1989': 0.5, '1967': 0.5, '1997': 0.8, '1960': 0.7, '1961': 0.7, '1998': 0.8, '1992': 0.7, '1962': 0.9, '1985': 0.9, '1963': 1.2, '1986': 0.6, '1987': 0.7, '1948': 1.5, '1949': 7, '1968': 1.4, '1969': 0.5, '1980': 0.8, '1981': 1.6, '1942': 0.8, '1943': 0.7, '1966': 1.3, '1941': 0.6, '1946': 0.6, '1947': 1.6, '1944': 0.5, '1945': 1.5, '2003': 0.7, '1996': 1.6, '1999': 1.9, '2005': 1.5, '1984': 1.2, '1955': 0.6, '1954': 1.5, '1957': 1.4, '1956': 0.5, '1951': 1.2, '1950': 0.9, '1953': 0.7, '1952': 1, '1982': 1, '1959': 0.9, '1958': 1.4, '1983': 0.7, '1991': 0.8, '1990': 0.9, '1993': 0.8, '1988': 1.2, '1995': 0.9, '1994': 1.5, '1979': 0.6, '1978': 1.9, '1977': 0.6, '1976': 0.8, '1975': 0.8, '1974': 1.2, '1973': 0.7, '1972': 0.5, '1971': 1.7, '1970': 0.9, '2002': 0.8, '1964': 0.8, '2000': 1.2, '2001': 0.6, '2006': 0.6, '2007': 1.6, '2004': 0.5, '1965': 0.7, '2008': 1.5}
MONTH_MAP = {'11': 0.9, '10': 0.8, '12': 0.5, '1': 0.6, '3': 1.8, '2': 0.7, '5': 0.5, '4': 0.9, '7': 0.9, '6': 1.6, '9': 1.8, '8': 1.5}
DAY_MAP = {'24': 0.9, '25': 1.5, '26': 1.8, '27': 0.7, '20': 1.5, '21': 1, '22': 0.9, '23': 0.8, '28': 0.8, '29': 1.6, '1': 0.5, '3': 0.8, '2': 1, '5': 1.6, '4': 1.5, '7': 0.8, '6': 1.5, '9': 0.8, '8': 1.6, '11': 0.9, '10': 1.6, '13': 0.8, '12': 1.7, '15': 1, '14': 1.7, '17': 0.9, '16': 0.8, '19': 0.5, '18': 1.8, '30': 0.6}
HOUR ={'24': 1.6, '20': 0.6, '21': 0.6, '22': 0.6, '23': 1.6, '1': 0.6, '3': 0.7, '2': 0.6, '5': 1, '4': 0.7, '7': 0.9, '6': 1, '9': 1.6, '8': 0.9, '11': 1, '10': 1.6, '13': 0.8, '12': 1, '15': 0.8, '14': 0.8, '17': 0.9, '16': 0.8, '19': 0.6, '18': 0.9}


def get_life(year,month,day,hour):
    score = YEAR_MAP[year]+MONTH_MAP[month]+DAY_MAP[day]+HOUR[hour]
    life_language = LIFE_MAP[str(score)]
    weight_list =str(score).split(".")
    life_weight = weight_list[0]+"两"+weight_list[1]+"钱"
    return life_weight,life_language


if __name__ == '__main__':
    print("请输入农历生辰！")
    year = str(input("请输入出生的年份："))
    month = str(input("请输入出生的月份："))
    day = str(input("请输入出生的日子："))
    hour = str(input("请输入出生的小时："))
    try:
        life_weight,life_language = get_life(year,month,day,hour)
        print("你的生辰八字重量为：%s" % life_weight)
        print("你的八字真言为：%s" % life_language)
    except:
        print("请正确输入！")
